//--------------------------------------------------------------------------------------
// File: ProjectX.fx
//
// Copyright (c) Microsoft Corporation. All rights reserved.
//--------------------------------------------------------------------------------------


//--------------------------------------------------------------------------------------
// Переменные константных буферов
//--------------------------------------------------------------------------------------
cbuffer ConstantBuffer : register(b0) // b0 - индекс буфера
{
	matrix World;
	matrix View;
	matrix Projection;
}


//--------------------------------------------------------------------------------------
// Форматы данных
//--------------------------------------------------------------------------------------
struct VS_INPUT
{
	float4 Pos : POSITION;
	float4 Color : COLOR;
};

struct PS_INPUT
{
	float4 Pos : SV_POSITION;
	float4 Color : COLOR;
};


//--------------------------------------------------------------------------------------
// Вершинный шейдер
//--------------------------------------------------------------------------------------
PS_INPUT VS( VS_INPUT input )
{
	PS_INPUT output = (PS_INPUT)0;
	// Трансформация позиции вершины при помощи умножения на матрицу
	output.Pos = mul(input.Pos, World);			// сначала в пространство мира
	output.Pos = mul(output.Pos, View);			// затем в пространство вида
	output.Pos = mul(output.Pos, Projection);	// в проекционное пространство
	output.Color = input.Color;
	return output;
}


//--------------------------------------------------------------------------------------
// Пиксельный шейдер
//--------------------------------------------------------------------------------------
float4 PS(PS_INPUT input) : SV_Target
{
	return input.Color;
}
